let MAPS = {
    1: [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [3, 3, 3, 3, 3, 3, 3, 3, 3, 3],
    [8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    [4, 4, 4, 4, 4, 4, 4, 4, 4, 4]],

    2: [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [3, 3, 3, 3, 3, 3, 3, 3, 3, 3],
    [8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    [4, 4, 4, 4, 4, 4, 4, 4, 4, 4]]


    // 2: [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    //     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    //     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    //     // [3, 3, 3, 3, 3, 3, 3, 3, 3, 3],
    //     // [8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
    //     // [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    //     [4, 4, 4, 4, 4, 4, 4, 4, 4, 4]],


    // 3: [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    //     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    //     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    //     [3, 3, 3, 3, 3, 3, 3, 3, 3, 3],
    //     [8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
    //     [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    //     [4, 4, 4, 4, 4, 4, 4, 4, 4, 4],
    //     [5, 5, 5, 5, 5, 5, 5, 5, 5, 5],
    //     [6, 6, 6, 6, 6, 6, 6, 6, 6, 6]]
};

let STORY = {
    1: ['В начале были лишь Свет и Тьма. Тысячелетия назад они столкнулись во Вселенской Пустоте.',
        'Их слияние создала бесконечные планеты и звёзды, которые образовали космос, а затем и жизнь в них, в удивительном разнообразии.',
        'Самые первые миры и их жители напоминали квадраты и прямоугольники. Среди них была планета Arkanius, в которой проживала раса, именующие себя Arkanoid.',
        'Уже тогда разные расы начали воевать между собой. Но оружие тогда всё ещё не изобрели, и все существа согласились, что их воины будут использовать шарик и отражать его в друг друга, пока не выявится победитель.',
        'Это история об единственном (возможно) воине расы Arkanoid, который защищал свой мир от нашествия других. Среди всех представителей планеты Arkanius, лишь он один был способен сражаться. Его звали Джөнни.',
        'Он защищал свою планету от врагов уже несколько сотен лет. Принимая все вражеские удары шаром на себя, он всегда защищал свой народ. О нём гласили легенды во всём космическом пространстве. Величайшие из великих говорили, что он самое сильное существо в мире.',
        'Но однажды ему повстречались враги, которых даже он не мог одолеть. В той битве длиною в вечность, Джөнни был повержен.'],

    2: ['Его сын, Шмөнни, пытаясь отомстить за отца, бросает вызов судьбе. Молясь всем духам, богам и дьяволам, он желает, чтобы его отец был отмщён.',
        'Неизвестно, кто принял его молитвы, и приняты ли были они вообще, но он с легкостью начинает побеждать тех, кто убил его отца.',
        'Убивая всё больше врагов, он начал наслаждаться этим. Он не испытывал ни капли жалости тем монстрам - они были не достойны этого.',
        'По крайней мере, он так считал и не собирался останавливаться.'],

    3: ['Убивая всё больше и больше врагов, жажда мести Шмөнни превратилась в жажду крови.',
        'Хоть и битва уже давно была закончена, для него она всё ещё продолжалась. Он видел врагов везде, куда бы ни пошёл.',
        'Он пережил ту битву тысячи раз в своих мыслях и, в конце концов, потерял грань между реальностью и своим воображением.',
        'Своих близких его разум уже начал воспринимать за врагов. И так, в итоге, Шмөнни перебил всю свою нацию.',
        'Конец.']
}